zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/inc/n32g457_eth.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g457_eth.h
 * @author Nations
 * @version from N32G45x_Library.2.6.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __N32G457_ETH_H__
#define __N32G457_ETH_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g45x.h"

/** @addtogroup N32G45X_StdPeriph_Driver
 * @{
 */

/** @addtogroup ETH
 * @{
 */

/** @addtogroup ETH_Exported_Types
 * @{
 */

/**
 * @brief  ETH MAC Init structure definition
 * @note   The user should not configure all the ETH_InitType structure's fields.
 *   By calling the ETH_InitStruct function the structures fields are set to their default values.
 *   Only the parameters that will be set to a non-default value should be configured.
 */
typedef struct
{
    uint32_t AutoNegotiation; /*!< Selects or not the AutoNegotiation mode for the external PHY
                                     The AutoNegotiation allows an automatic setting of the Speed (10/100Mbps)
                                     and the mode (half/full-duplex).
                                     This parameter can be a value of @ref AutoNegotiation */

    uint32_t Watchdog; /*!< Selects or not the Watchdog timer
                              When enabled, the MAC allows no more then 2048 bytes to be received.
                              When disabled, the MAC can receive up to 16384 bytes.
                              This parameter can be a value of @ref ETH_watchdog */

    uint32_t Jabber; /*!< Selects or not Jabber timer
                            When enabled, the MAC allows no more then 2048 bytes to be sent.
                            When disabled, the MAC can send up to 16384 bytes.
                            This parameter can be a value of @ref Jabber */

    uint32_t InterFrameGap; /*!< Selects the minimum IFG between frames during transmission
                                   This parameter can be a value of @ref ETH_Inter_Frame_Gap */

    uint32_t CarrierSense; /*!< Selects or not the Carrier Sense
                                  This parameter can be a value of @ref ETH_Carrier_Sense */

    uint32_t SpeedMode; /*!< Sets the Ethernet speed: 10/100 Mbps
                           This parameter can be a value of @ref SpeedMode */

    uint32_t RxOwn; /*!< Selects or not the ReceiveOwn
                                ReceiveOwn allows the reception of frames when the TX_EN signal is asserted
                                in Half-Duplex mode
                                This parameter can be a value of @ref ETH_Receive_Own */

    uint32_t LoopbackMode; /*!< Selects or not the internal MAC MII Loopback mode
                                  This parameter can be a value of @ref ETH_Loop_Back_Mode */

    uint32_t DuplexMode; /*!< Selects the MAC duplex mode: Half-Duplex or Full-Duplex mode
                          This parameter can be a value of @ref ETH_Duplex_Mode */

    uint32_t ChecksumOffload; /*!< Selects or not the IPv4 checksum checking for received frame payloads' TCP/UDP/ICMP
                                 headers. This parameter can be a value of @ref ETH_Checksum_Offload */

    uint32_t RetryTransmission; /*!< Selects or not the MAC attempt retries transmission, based on the settings of BL,
                                       when a colision occurs (Half-Duplex mode)
                                       This parameter can be a value of @ref ETH_Retry_Transmission */

    uint32_t AutomaticPadCRCStrip; /*!< Selects or not the Automatic MAC Pad/CRC Stripping
                                          This parameter can be a value of @ref ETH_Automatic_Pad_CRC_Strip */

    uint32_t BackoffLimit; /*!< Selects the BackOff limit value
                                  This parameter can be a value of @ref ETH_Back_Off_Limit
                                  This parameer only valid in ETH_DUPLEX_MODE_HALF mode*/

    uint32_t DeferralCheck; /*!< Selects or not the deferral check function (Half-Duplex mode)
                                   This parameter can be a value of @ref ETH_Deferral_Check */

    uint32_t RxAll; /*!< Selects or not all frames reception by the MAC (No fitering)
                                This parameter can be a value of @ref ETH_Receive_All */

    uint32_t SrcAddrFilter; /*!< Selects the Source Address Filter mode
                                      This parameter can be a value of @ref ETH_Source_Addr_Filter */

