zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/inc/n32g457_eth.h
#define IS_ETH_PTP_SUBSECOND_INCREMENT(SUBSECOND) ((SUBSECOND) <= 0xFF)

/**
 * @}
 */

/** @addtogroup ETH_PTP_time_sign
 * @{
 */
#define ETH_PTP_POSITIVE_TIME      ((uint32_t)0x00000000) /*!< Positive time value */
#define ETH_PTP_NEGATIVE_TIME      ((uint32_t)0x80000000) /*!< Negative time value */
#define IS_ETH_PTP_TIME_SIGN(SIGN) (((SIGN) == ETH_PTP_POSITIVE_TIME) || ((SIGN) == ETH_PTP_NEGATIVE_TIME))

#define IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND(SUBSECOND) ((SUBSECOND) <= 0x7FFFFFFF)

#define ETH_PTPTSCTRL ((uint32_t)0x00000700) /*!< PTP TSCR register */
#define ETH_PTPSSINC  ((uint32_t)0x00000704) /*!< PTP SSIR register */
#define ETH_PTPSEC    ((uint32_t)0x00000708) /*!< PTP TSHR register */
#define ETH_PTPNS     ((uint32_t)0x0000070C) /*!< PTP TSLR register */
#define ETH_PTPSECUP  ((uint32_t)0x00000710) /*!< PTP TSHUR register */
#define ETH_PTPNSUP   ((uint32_t)0x00000714) /*!< PTP TSLUR register */
#define ETH_PTPTSADD  ((uint32_t)0x00000718) /*!< PTP TSAR register */
#define ETH_PTPTTSEC  ((uint32_t)0x0000071C) /*!< PTP TTHR register */
#define ETH_PTPTTNS   ((uint32_t)0x00000720) /* PTP TTLR register */
#define IS_ETH_PTP_REGISTER(REG)                                                                                       \
    (((REG) == ETH_PTPTSCTRL) || ((REG) == ETH_PTPSSINC) || ((REG) == ETH_PTPSEC) || ((REG) == ETH_PTPNS)              \
     || ((REG) == ETH_PTPSECUP) || ((REG) == ETH_PTPNSUP) || ((REG) == ETH_PTPTSADD) || ((REG) == ETH_PTPTTSEC)        \
     || ((REG) == ETH_PTPTTNS))

/**
 * @}
 */

/**
 * @}
 */
/** @addtogroup ETH_Exported_Macros
 * @{
 */
/**
 * @}
 */

/* ETHERNET errors */
#define ETH_ERROR   ((uint32_t)0)
#define ETH_SUCCESS ((uint32_t)1)

#define PHY_READ_TO  ((uint32_t)0x0004FFFF)
#define PHY_WRITE_TO ((uint32_t)0x0004FFFF)

/* Buffer size for receive */
#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE
/* Buffer size for transmit */
#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE
/* Rx buffers of size ETH_RX_BUF_SIZE */
#define ETH_RXBUFNB     4
/* Tx buffers of size ETH_TX_BUF_SIZE */
#define ETH_TXBUFNB     4

#define ETH_INTERFACE_RMII 0
#define ETH_INTERFACE_MII  1

/* ETH External PHY Configuration Delay */
#define ETH_PHY_CONFIG_DELAY ((uint32_t)0x0000FFFF)
/* ETH Timeout values macro definition */
#define ETH_SWRESET_TIMEOUT  ((uint32_t)0xF0000000U)

/* ETH Link speed duplex definition */
#define ETH_LINK_10FULL   ((uint32_t)0x00000001U)
#define ETH_LINK_10HALF   ((uint32_t)0x00000002U)
#define ETH_LINK_100FULL  ((uint32_t)0x00000004U)
#define ETH_LINK_100HALF  ((uint32_t)0x00000008U)


/**
 * @brief the function prototype of initialize PHY.
 * @param ETH_InitStruct init struct of ETH MAC peripheral.
 * @return whether initialization succeed:
 *  - ETH_ERROR initialization fail
 *  - ETH_SUCCESS initialization succeed
 */
typedef uint32_t (*ETH_InitPHY)(ETH_InitType* ETH_InitStruct);

/** @addtogroup ETH_Exported_Functions
 * @{
 */
void ETH_Delay(__IO uint32_t nCount);
void ETH_DeInit(void);
uint32_t ETH_Init(ETH_InitType* ETH_InitStruct, ETH_InitPHY callable);
void ETH_InitStruct(ETH_InitType* ETH_InitStruct);
void ETH_SoftwareReset(void);
FlagStatus ETH_GetSoftwareResetStatus(void);
void ETH_Start(void);
uint32_t ETH_GetRxPacketSize(ETH_DMADescType *DMARxDesc);

/** 
  * @brief  PHY
  */ 
uint16_t ETH_ReadPHYRegister(uint16_t PHYAddress, uint16_t PHYReg);
uint32_t ETH_WritePHYRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue);

/** 
  * @brief  MAC
  */
void ETH_MACTransmissionCmd(FunctionalState NewState);
void ETH_MACReceptionCmd(FunctionalState NewState);
FlagStatus ETH_GetFlowControlBusyStatus(void);
void ETH_InitiatePauseControlFrame(void);  
void ETH_BackPressureActivationCmd(FunctionalState NewState); 
FlagStatus ETH_GetMACFlagStatus(uint32_t ETH_MAC_FLAG);  
INTStatus ETH_GetMACITStatus(uint32_t ETH_MAC_IT);
void ETH_MACITConfig(uint32_t ETH_MAC_IT, FunctionalState NewState);
void ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr);
void ETH_GetMACAddress(uint32_t MacAddr, uint8_t *Addr);
void ETH_MACAddressPerfectFilterCmd(uint32_t MacAddr, FunctionalState NewState);
void ETH_MACAddressFilterConfig(uint32_t MacAddr, uint32_t Filter);
void ETH_MACAddressMaskBytesFilterConfig(uint32_t MacAddr, uint32_t MaskByte);

/** 
  * @brief  DMA Tx/Rx descriptors
  */ 
void ETH_DMARxDescChainInit(ETH_DMADescType *DMARxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount);
void ETH_DMATxDescChainInit(ETH_DMADescType *DMATxDescTab, uint8_t* TxBuff, uint32_t TxBuffCount);
uint32_t ETH_PrepareTransmitDescriptors(uint16_t FrameLength);
ETH_FrameType ETH_GetReceivedFrame(void);
FlagStatus ETH_GetDMATxDescFlagStatus(ETH_DMADescType *DMATxDesc, uint32_t ETH_DMATxDescFlag);
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADescType *DMATxDesc);
void ETH_SetDMATxDescOwnBit(ETH_DMADescType *DMATxDesc);
void ETH_DMATxDescTransmitITConfig(ETH_DMADescType *DMATxDesc, FunctionalState NewState);
void ETH_DMATxDescFrameSegmentConfig(ETH_DMADescType *DMATxDesc, uint32_t DMATxDesc_FrameSegment);
void ETH_DMATxDescChecksumInsertionConfig(ETH_DMADescType *DMATxDesc, uint32_t DMATxDesc_Checksum);
void ETH_DMATxDescCRCCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState);
void ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState);
void ETH_DMATxDescShortFramePaddingCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState);
void ETH_DMATxDescBufferSizeConfig(ETH_DMADescType *DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2);
FlagStatus ETH_GetDMARxDescFlagStatus(ETH_DMADescType *DMARxDesc, uint32_t ETH_DMARxDescFlag);
void ETH_SetDMARxDescOwnBit(ETH_DMADescType *DMARxDesc);
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADescType *DMARxDesc);
void ETH_DMARxDescReceiveITConfig(ETH_DMADescType *DMARxDesc, FunctionalState NewState);
void ETH_DMARxDescSecondAddressChainedCmd(ETH_DMADescType *DMARxDesc, FunctionalState NewState);
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADescType *DMARxDesc, uint32_t DMARxDesc_Buffer);
ETH_FrameType ETH_GetReceivedFrameInterrupt(void);

/** 
  * @brief  DMA
  */
FlagStatus ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG);
void ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG);
INTStatus ETH_GetDMAITStatus(uint32_t ETH_DMA_IT);
void ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT);
uint32_t ETH_GetTransmitProcessState(void);
uint32_t ETH_GetReceiveProcessState(void);
void ETH_FlushTransmitFIFO(void);
FlagStatus ETH_GetFlushTransmitFIFOStatus(void);
void ETH_DMATransmissionCmd(FunctionalState NewState);
void ETH_DMAReceptionCmd(FunctionalState NewState);
void ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState);
FlagStatus ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow);
uint32_t ETH_GetRxOverflowMissedFrameCounter(void);
uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void);
uint32_t ETH_GetCurrentTxDescStartAddress(void);
uint32_t ETH_GetCurrentRxDescStartAddress(void);
uint32_t ETH_GetCurrentTxBufferAddress(void);
uint32_t ETH_GetCurrentRxBufferAddress(void);
void ETH_ResumeDMATransmission(void);
void ETH_ResumeDMAReception(void);
void ETH_SetReceiveWatchdogTimer(uint8_t Value);

/** 
  * @brief  PMT
  */
void ETH_ResetWakeUpFrameFilterRegisterPointer(void);
void ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer);
void ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState);
FlagStatus ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG);
void ETH_WakeUpFrameDetectionCmd(FunctionalState NewState);
void ETH_MagicPacketDetectionCmd(FunctionalState NewState);
void ETH_PowerDownCmd(FunctionalState NewState);

/** 
  * @brief  MMC
  */
void ETH_MMCCounterFreezeCmd(FunctionalState NewState);
void ETH_MMCResetOnReadCmd(FunctionalState NewState);
void ETH_MMCCounterRolloverCmd(FunctionalState NewState);
void ETH_MMCCountersReset(void);
void ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState);
INTStatus ETH_GetMMCITStatus(uint32_t ETH_MMC_IT);
uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __N32G457_ETH_H__ */
/**
 * @}
 */

/**
 * @}
 */
